app/controllers/sessions_controller.rb

    def create
         user=User.where("email=? AND password=?",params[:email],params[:password]).first
---
SELECT "users".* FROM "users" WHERE (email='abc' AND password='abc') LIMIT 1

    def login

         user=User.find(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "13"]]