app/controllers/users_controller.rb

def create

  @user=User.create(params[:user])
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 19 Nov 2013 10:35:57 UTC +00:00], ["email", "abc"], ["password", "abc"], ["updated_at", Tue, 19 Nov 2013 10:35:57 UTC +00:00]]

def show

  if current_user.present?
    @user=User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 24]]